artillerytests.yml
config:
  target: "http://localhost:3002"
  phases:
    - duration: 30
      arrivalCount: 10
      name: Warm up
    - duration: 30
      arrivalCount: 100
      name: Ramp up load
    - duration: 300
      arrivalCount: 1000
      name: Sustained load


scenarios:
  - name: "GET"
    flow:
      - get:
          url: "/1/reviews/{{$randomNumber(1,1000000)}}"